Documents/АктКонтроляКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктКонтроляКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаСклад</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтХранителя</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ЗаявкаНаКонтрольКачестваТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАктовКонтроляКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКонтрольКачестваТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперацияПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПоТоварамВАктеКонтроляКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиКачества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиКачестваТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодНазначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаОприходование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОприходование</Name>
							<Comment>Количество приходуемое (в единицах хранения)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исследование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыАктовКонтроляКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыАктовКонтроляКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетРешения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияПоТоварамВАктеКонтроляКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияПоТоварамВАктеКонтроляКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разблокировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПорчу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьКачество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПриходовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктКонтроляКачестваТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	// Товары.Действие.
	Если Статус = Перечисления.СтатусыАктовКонтроляКачества.ВРаботе
			Или Статус = Перечисления.СтатусыАктовКонтроляКачества.ОжидаетРешения Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Действие");
	КонецЕсли;
	
	// Товары.РезультатПроверкиКачества.
	Если Статус = Перечисления.СтатусыАктовКонтроляКачества.ВРаботе Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.РезультатПроверкиКачества");
	КонецЕсли;
	
	// Товары.Характеристика.
	// Товары.ХарактеристикаОприходование.
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	ПараметрыПроверки.ИменаПолейССуффиксом.Вставить("Номенклатура", "НоменклатураОприходование");
	ПараметрыПроверки.ИменаПолейССуффиксом.Вставить("Характеристика", "ХарактеристикаОприходование");
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(
		ЭтотОбъект,
		МассивНепроверяемыхРеквизитов,
		Отказ,
		ПараметрыПроверки);
	
	// Товары.Серия.
	НоменклатураСервер.ПроверитьЗаполнениеСерий(
		ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.АктКонтроляКачестваТоваров),
		Отказ,
		МассивНепроверяемыхРеквизитов);
		
	// Товары.Помещение.
	// Товары.Ячейка.
	СкладыСервер.ПроверитьЗаполнениеПомещений(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	СкладыСервер.ПроверитьЗаполнениеЯчеек(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ПроверитьКомплектностьТоварныхМест = Истина;
	ПараметрыПроверки.ПоляГруппировкиПроверкиКомплектности = "Действие,Назначение,Склад,Помещение";
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	// Проверка заполнения упаковок номенклатуры на адресных складах
	ВыборкаСкладПомещение = КонтрольКачества.ВыборкаСкладПомещение(Товары.Выгрузить(,"Склад,Помещение"), Дата);
	Пока ВыборкаСкладПомещение.Следующий() Цикл
		ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияУпаковок();
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Склад", ВыборкаСкладПомещение.Склад);
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Помещение", ВыборкаСкладПомещение.Помещение);
		ИменаПолейССуффиксом = Новый Структура();
		ИменаПолейССуффиксом.Вставить("Номенклатура", "НоменклатураОприходование");
		ИменаПолейССуффиксом.Вставить("Упаковка", "УпаковкаОприходование");
		ПараметрыПроверки.ИменаПолейССуффиксом = ИменаПолейССуффиксом;
		НоменклатураСервер.ПроверитьЗаполнениеУпаковок(
			ЭтотОбъект,
			МассивНепроверяемыхРеквизитов,
			Отказ,
			ПараметрыПроверки);
	КонецЦикла;
	Если МассивНепроверяемыхРеквизитов.Найти("Товары.Упаковка") = Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
	КонецЕсли;
	Если МассивНепроверяемыхРеквизитов.Найти("Товары.УпаковкаОприходование") = Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.УпаковкаОприходование");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.НоменклатураОприходование");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПодНазначение");
	
	
	ШаблонСообщенияНеЗаполнено = НСтр("ru='Не заполнена колонка Номенклатура (оприходование) в строке %1 списка ""Товары"".'");
	ШаблонСообщенияОдинаковые = НСтр("ru='В строке %1 списка ""Товары"" товар исходного качества совпадает с товаром другого качества'");
	ШаблонКоличествоОприходование = НСтр("ru = 'Количество номенклатуры исходного качества ""%НоменклатураСписания%"" в строке ""%НомерСтроки%"" списка ""Товары"" отличается от количества номенклатуры другого качества ""%НоменклатураОприходования%"" на ""%Количество%"" единиц хранения'");

	Для Индекс = 0 По Товары.Количество() - 1 Цикл
		
		СтрокаТаблицы = Товары[Индекс];
		Поле = СтрШаблон("Товары[%1].НоменклатураОприходование", Индекс);
		
		// Товары.НоменклатураОприходование
		Если (СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ИзменитьКачество
				Или СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьПорчу) Тогда
				
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураОприходование) Тогда
				
				ПутьКТабЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары",
					СтрокаТаблицы.НомерСтроки,
					"НоменклатураОприходование");
				
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(ШаблонСообщенияНеЗаполнено, Индекс + 1),
					ЭтотОбъект,
					ПутьКТабЧасти,
					,
					Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
					И СтрокаТаблицы.Номенклатура = СтрокаТаблицы.НоменклатураОприходование Тогда
					
				ПутьКТабЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары",
					СтрокаТаблицы.НомерСтроки,
					"НоменклатураОприходование");
					
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(ШаблонСообщенияОдинаковые, Индекс + 1),
					ЭтотОбъект,
					ПутьКТабЧасти,
					,
					Отказ);
					
			КонецЕсли;
			
	
			// Товары.КоличествоОприходование
			Если СтрокаТаблицы.Количество <> СтрокаТаблицы.КоличествоОприходование
					И ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураОприходование) Тогда
					
				КоличествоРасхождение = СтрокаТаблицы.Количество - СтрокаТаблицы.КоличествоОприходование;
				КоличествоРасхождение = Макс(КоличествоРасхождение, -КоличествоРасхождение);
				
				ПредставлениеНоменклатурыСписания = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТаблицы.Номенклатура,
					СтрокаТаблицы.Характеристика,
					СтрокаТаблицы.Упаковка,
					СтрокаТаблицы.Серия,
					СтрокаТаблицы.Назначение);
				ПредставлениеНоменклатурыОприходования = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТаблицы.НоменклатураОприходование,
					СтрокаТаблицы.ХарактеристикаОприходование,
					СтрокаТаблицы.УпаковкаОприходование);
				
				ТекстСообщения = СтрЗаменить(ШаблонКоличествоОприходование, "%НомерСтроки%", Индекс + 1);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НоменклатураСписания%", ПредставлениеНоменклатурыСписания);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НоменклатураОприходования%", ПредставлениеНоменклатурыОприходования);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", КоличествоРасхождение);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Индекс + 1, "КоличествоУпаковок");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					Поле,
					"Объект",
					Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура,
		|	ТаблицаТоваров.НоменклатураОприходование,
		|	ТаблицаТоваров.НомерСтроки
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
		|	ВЫРАЗИТЬ(ТаблицаТоваров.НоменклатураОприходование КАК Справочник.Номенклатура).ТипНоменклатуры КАК НоменклатураОприходованиеТипНоменклатуры
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров
		|ГДЕ
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры <> ВЫРАЗИТЬ(ТаблицаТоваров.НоменклатураОприходование КАК Справочник.Номенклатура).ТипНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		ТаблицаТоваров = Товары.Выгрузить(Новый Массив(), "НомерСтроки,Номенклатура,НоменклатураОприходование");
		Для Каждого СтрокаТаблицы Из Товары Цикл
			
			Если СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ИзменитьКачество
					Или СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьПорчу Тогда
				
				ЗаполнитьЗначенияСвойств(ТаблицаТоваров.Добавить(), СтрокаТаблицы);
				
			КонецЕсли;
			
		КонецЦикла;
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ТекстОшибки = НСтр("ru='В строке %НомерСтроки% списка ""Товары"" не совпадают типы номенклатуры. У номенклатуры исходного качества тип %НоменклатураТипНоменклатуры%, другого качества - %НоменклатураОприходованиеТипНоменклатуры%.'");
		
		Пока Выборка.Следующий() Цикл
			СообщениеОбОшибке = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Выборка.НомерСтроки); 
			СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%НоменклатураТипНоменклатуры%", Выборка.НоменклатураТипНоменклатуры); 
			СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%НоменклатураОприходованиеТипНоменклатуры%", Выборка.НоменклатураОприходованиеТипНоменклатуры); 
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "НоменклатураОприходование");
			ОбщегоНазначения.СообщитьПользователю(
				СообщениеОбОшибке,
				ЭтотОбъект,
				Поле,
				,
				Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
	// Вид номенклатуры оприходование.
	ТаблицаДляПроверки = Товары.Выгрузить(, "Номенклатура,НоменклатураОприходование");
	ТаблицаДляПроверки.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	Для Индекс = 0 По Товары.Количество() - 1 Цикл
		СтрокаТаблицы = Товары[Индекс];
		Если СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ИзменитьКачество
				Или СтрокаТаблицы.Действие = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.ОформитьПорчу Тогда
			НоваяСтрока = ТаблицаДляПроверки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.НомерСтроки = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	НоменклатураСервер.ПроверитьВидНоменклатурыОприходования(ЭтотОбъект, Отказ, "Товары", ТаблицаДляПроверки);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда
		ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров") Тогда
		ЗаполнитьНаОснованииЗаявкиНаКонтрольКачестваТоваров(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ВстраиваемыеМеханизмы

// Устанавливает статус для объекта документа
//
// Параметры:
//	НовыйСтатус - Строка - Имя статуса, который будет установлен у заказов
//	ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса.
//
// Возвращаемое значение:
//	Булево - Истина, в случае успешной установки нового статуса.
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	Статус = Перечисления.СтатусыАктовКонтроляКачества[НовыйСтатус];
	
	Возврат ПроверитьЗаполнение();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры


Процедура ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявкиНаКонтрольКачестваТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Ложь, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков товаров к оформлению актов контроля качества. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	КонтролируемаяПартия = Аналитики[0].КонтролируемаяПартия;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры


Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыАктовКонтроляКачества.ВРаботе;
	КонецЕсли;
	Если Товары.Количество() = 0 Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	Иначе
		КонтрольКачества.ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента(ЭтотОбъект);
	КонецЕсли;
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Ответственный, Подразделение);
	Автор = Пользователи.ТекущийПользователь();
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Товары.Количество() > 0 Тогда
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.АктКонтроляКачестваТоваров);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	КонецЕсли;
	Документы.АктКонтроляКачестваТоваров.ЗаполнитьРеквизитыИзПартии(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
